Examinator/src/Documents/ПопыткаВыполненияЗаданияСУО/ПопыткаВыполненияЗаданияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПопыткаВыполненияЗаданияСУО</name>
  <registerRecords>InformationRegister.БиблиотекаПользователейСУО</registerRecords>
  <registerRecords>InformationRegister.ПопыткиПрохожденияЗаданийСУО</registerRecords>
  <attributes>
    <name>ПрохождениеОбучения</name>
    <type>
      <types>DocumentRef.ПрохождениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Задание</name>
    <type>
      <types>DefinedType.ЗаданиеЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>Вариант</name>
    <type>
      <types>CatalogRef.ВариантыЗаданийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Баллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершеноВПроцентах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПопыткаЗавершена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяетсяПреподавателем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверенПреподавателем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийПреподавателя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозвращеноНаДоработку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроверки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВозвратаНаДоработку</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправкиНаПроверку</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаВозвратаНаДоработку</name>
    <type>
      <types>CatalogRef.ПричиныВозвратаЗаданияНаДоработкуСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверившийПреподаватель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяющийПреподаватель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнейАктивностиПроверки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнейАктивности</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроходнойБалл</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗатраченоВремениВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отменено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДоступаКЗаданию</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДоступаКЗаданию</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрытьВремяДоступаКЗаданию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыставляетсяОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

Examinator/src/InformationRegisters/ПопыткиПрохожденияЗаданийСУО/ПопыткиПрохожденияЗаданийСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПопыткиПрохожденияЗаданийСУО</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Баллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Выполнено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Мероприятие</name>
    <type>
      <types>CatalogRef.КаталогМероприятийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПопыткаЗавершена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнейАктивности</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительскоеПрохождение</name>
    <type>
      <types>DocumentRef.ПрохождениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ШкалаОценки</name>
    <type>
      <types>CatalogRef.ШкалыОценокСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершеноВПроцентах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяетсяПреподавателем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверенПреподавателем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправкиНаПроверку</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийПреподавателя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НесколькоВариантов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Вариант</name>
    <type>
      <types>CatalogRef.ВариантыЗаданийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозвращеноНаДоработку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаВозвратаНаДоработку</name>
    <type>
      <types>CatalogRef.ПричиныВозвратаЗаданияНаДоработкуСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВозвратаНаДоработку</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Значимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроходнойБалл</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗатраченоВремениВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеЖдатьПроверки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверившийПреподаватель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроверки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДоступаКЗаданию</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДоступаКЗаданию</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрытьВремяДоступаКЗаданию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыставляетсяОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Задание</name>
    <type>
      <types>DefinedType.ЗаданиеЭлектронногоОбучения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПрохождениеОбучения</name>
    <type>
      <types>DocumentRef.ПрохождениеОбученияСУО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/БиблиотекаПользователейСУО/БиблиотекаПользователейСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>БиблиотекаПользователейСУО</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>Метка</name>
    <type>
      <types>CatalogRef.СтруктураБиблиотекиПользователейСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Библиотека</name>
    <type>
      <types>CatalogRef.КаталогМероприятийСУО</types>
      <types>CatalogRef.СхемыМероприятийСУО</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ресурс</name>
    <type>
      <types>CatalogRef.ЛитератураСУО</types>
      <types>CatalogRef.Файлы</types>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
      <types>CatalogRef.ЗаданияСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Фрагмент</name>
    <type>
      <types>CatalogRef.СодержаниеКнигиСУО</types>
      <types>CatalogRef.СодержаниеСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/СтатусыПрохожденияОбъектовСУО/СтатусыПрохожденияОбъектовСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыПрохожденияОбъектовСУО</name>
  <enumValues>
    <name>Зачислен</name>
  </enumValues>
  <enumValues>
    <name>Проходит</name>
  </enumValues>
  <enumValues>
    <name>Завершил</name>
  </enumValues>
  <enumValues>
    <name>НеЗавершил</name>
  </enumValues>
  <enumValues>
    <name>НеДопущен</name>
  </enumValues>
  <enumValues>
    <name>Автомат</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Documents/ПопыткаВыполненияЗаданияСУО/ObjectModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем СвойстваЗаданияВПроведении;
Перем ДанныеПрохождения;

#КонецОбласти

#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;		
	КонецЕсли;
	
	ДанныеПрохождения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПрохождениеОбучения, "Пользователь, Сценарий, РодительскоеПрохождение, Статус, ДобавленоВремениВСекундах");
	СвойстваЗаданияВПроведении = Документы.ПрохождениеОбученияСУО.СвойстваЗаданияПрохождения(ПрохождениеОбучения, Задание);
	
	Если СвойстваЗаданияВПроведении = Неопределено Тогда
		ПроходнойБалл = 0;
	Иначе		
		ПроходнойБалл = СвойстваЗаданияВПроведении.ПроходнойБалл;
	КонецЕсли;
	
	Если СвойстваЗаданияВПроведении = Неопределено Тогда
		ДатаНачалаДоступаКЗаданию = Дата("00010101");
		ДатаОкончанияДоступаКЗаданию = Дата("00010101");					
	Иначе
		ДатаНачалаДоступаКЗаданию = Документы.ПопыткаВыполненияЗаданияСУО.ДатаДоступаКЗаданию(СвойстваЗаданияВПроведении.ДатаНачалаДоступаКЗаданию, ДанныеПрохождения.ДобавленоВремениВСекундах);
		ДатаОкончанияДоступаКЗаданию = Документы.ПопыткаВыполненияЗаданияСУО.ДатаДоступаКЗаданию(СвойстваЗаданияВПроведении.ДатаОкончанияДоступаКЗаданию, ДанныеПрохождения.ДобавленоВремениВСекундах);						
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаНачалаДоступаКЗаданию) ИЛИ ЗначениеЗаполнено(ДатаОкончанияДоступаКЗаданию) Тогда
		СкрытьВремяДоступаКЗаданию = СвойстваЗаданияВПроведении.СкрытьВремяДоступаКЗаданию;
	Иначе
		СкрытьВремяДоступаКЗаданию = Ложь;
	КонецЕсли;
	
	Если НЕ ДополнительныеСвойства.Свойство("ПриПрохожденииОбучения")
		ИЛИ НЕ ДополнительныеСвойства.ПриПрохожденииОбучения Тогда
		
		// Если это проведение при прохождении задания, то реквизит ВыставляетсяОценка уже заполнен.
		
		ВидОбучения = Документы.ПроведениеОбученияСУО.ВидОбучения(ПроведениеОбучения, ДанныеПрохождения.Сценарий);		
		
		ВыставляетсяОценка = Документы.ПопыткаВыполненияЗаданияСУО.ВыставляетсяОценка(
			ПроведениеОбучения, Задание, ДанныеПрохождения.Сценарий, ВидОбучения, ПрохождениеОбучения, ДанныеПрохождения.Пользователь);
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ВыполнениеОтменено = Документы.ПопыткаВыполненияЗаданияСУО.Отменено(Ссылка);
	
	Движения.ПопыткиПрохожденияЗаданийСУО.Записывать = Истина;
	Движения.БиблиотекаПользователейСУО.Записывать   = Истина;
	
	Если НЕ ВыполнениеОтменено И СвойстваЗаданияВПроведении <> Неопределено Тогда
		
		// СвойстваЗаданияВПроведении может быть неопределено, если задание было удалено из обучения
		
		Если ТипЗнч(Задание) = Тип("СправочникСсылка.ЗаданияСУО") Тогда
			ДанныеЗадания = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Задание, "НесколькоВариантов, ДобавитьВБиблиотеку, МеткаВБиблиотеке, НаОсновеЭлектронногоРесурса, ЭлектронныйРесурс, Фрагмент, НеЖдатьПроверки");
		Иначе
			ДанныеЗадания = Новый Структура("НесколькоВариантов, ДобавитьВБиблиотеку, МеткаВБиблиотеке, НаОсновеЭлектронногоРесурса, ЭлектронныйРесурс, Фрагмент, НеЖдатьПроверки");
			ДанныеЗадания.НесколькоВариантов = Ложь;
			ДанныеЗадания.ДобавитьВБиблиотеку = Ложь;
			ДанныеЗадания.МеткаВБиблиотеке = Неопределено;
			ДанныеЗадания.НаОсновеЭлектронногоРесурса = Истина;
			ДанныеЗадания.ЭлектронныйРесурс = Задание;
			ДанныеЗадания.Фрагмент = Неопределено;
			ДанныеЗадания.НеЖдатьПроверки = Ложь;
		КонецЕсли;
		
		// Попытки
		
		Движение = Движения.ПопыткиПрохожденияЗаданийСУО.Добавить();
		Движение.Период                       = Дата;
		Движение.Задание                      = Задание;
		Движение.ПрохождениеОбучения          = ПрохождениеОбучения;
		Движение.Баллы                        = Баллы;
		Движение.Выполнено                    = Документы.ПопыткаВыполненияЗаданияСУО.Выполнено(Ссылка, ПопыткаЗавершена, ПроверяетсяПреподавателем, ПроверенПреподавателем, Баллы, СвойстваЗаданияВПроведении.ПроходнойБалл, ДатаОкончанияДоступаКЗаданию);
		Движение.Пользователь                 = ДанныеПрохождения.Пользователь;
		Движение.ШкалаОценки                  = Документы.ПроведениеОбученияСУО.ШкалаОценки(ПроведениеОбучения);
		Движение.ЗавершеноВПроцентах          = ЗавершеноВПроцентах;
		Движение.ПопыткаЗавершена             = ПопыткаЗавершена;
		Движение.РодительскоеПрохождение      = ДанныеПрохождения.РодительскоеПрохождение;
		Движение.ПроверяетсяПреподавателем    = ПроверяетсяПреподавателем;
		Движение.ПроверенПреподавателем       = ПроверенПреподавателем;
		Движение.ДатаОтправкиНаПроверку       = ДатаОтправкиНаПроверку;		
		Движение.КомментарийПреподавателя     = КомментарийПреподавателя;
		Движение.ПроведениеОбучения           = ПроведениеОбучения;
		Движение.Мероприятие                  = ДанныеПрохождения.Сценарий;		
		Движение.Вариант                      = Вариант;
		Движение.НесколькоВариантов           = ДанныеЗадания.НесколькоВариантов;
		Движение.ВозвращеноНаДоработку        = ВозвращеноНаДоработку;
		Движение.ПричинаВозвратаНаДоработку   = ПричинаВозвратаНаДоработку;
		Движение.ДатаВозвратаНаДоработку      = ДатаВозвратаНаДоработку;
		Движение.ДатаПоследнейАктивности      = ДатаПоследнейАктивности;
		Движение.Наименование                 = СвойстваЗаданияВПроведении.Наименование;
		Движение.Номер                        = СвойстваЗаданияВПроведении.Номер;
		Движение.Значимость                   = СвойстваЗаданияВПроведении.Значимость;
		Движение.ПроходнойБалл                = СвойстваЗаданияВПроведении.ПроходнойБалл;
		Движение.ЗатраченоВремениВСекундах    = ЗатраченоВремениВСекундах;
		Движение.НеЖдатьПроверки              = СвойстваЗаданияВПроведении.НеЖдатьПроверки;
		Движение.ПроверившийПреподаватель     = ПроверившийПреподаватель;
		Движение.ДатаПроверки                 = ДатаПроверки;		
		Движение.ДатаНачалаДоступаКЗаданию    = ДатаНачалаДоступаКЗаданию;
		Движение.ДатаОкончанияДоступаКЗаданию = ДатаОкончанияДоступаКЗаданию;
		Движение.СкрытьВремяДоступаКЗаданию   = СкрытьВремяДоступаКЗаданию;
		Движение.ВыставляетсяОценка           = ВыставляетсяОценка;
		
		// Библиотека пользователя
		
		Если ДанныеЗадания.ДобавитьВБиблиотеку И ПопыткаЗавершена 
			И (ДанныеПрохождения.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.Завершил
			ИЛИ ДанныеПрохождения.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.Автомат) Тогда
			
			Если ДанныеЗадания.НаОсновеЭлектронногоРесурса Тогда			
				ИсточникРесурса = ?(ЗначениеЗаполнено(Вариант), Вариант, ДанныеЗадания);				
			Иначе				
				// Задание является ресурсом для добавления в библиотеку				
				ИсточникРесурса = Новый Структура("ЭлектронныйРесурс, Фрагмент", Задание, Неопределено); 				
			КонецЕсли;			
			
			Если ЗначениеЗаполнено(ИсточникРесурса.ЭлектронныйРесурс) Тогда
				
				Движение = Движения.БиблиотекаПользователейСУО.Добавить();
				
				Движение.Пользователь = ДанныеПрохождения.Пользователь;
				Движение.Ресурс       = ИсточникРесурса.ЭлектронныйРесурс;
				Движение.Фрагмент     = ИсточникРесурса.Фрагмент;
				
				Движение.Период = Дата;
				Движение.Метка  = ДанныеЗадания.МеткаВБиблиотеке;
				
				Если ЗначениеЗаполнено(Движение.Метка) Тогда
					Движение.Библиотека = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Движение.Метка, "Владелец");
				КонецЕсли;
				
			КонецЕсли;
				
		КонецЕсли;
			
	КонецЕсли;
	
	Движения.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
